# GetInstanceTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceWithContext..::..GetInstanceTransform Method
ReferenceWithContext Class See Also
---
Gets the transform of the instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Transform GetInstanceTransform()
```

Visual Basic
---
```text
Public Function GetInstanceTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetInstanceTransform()
```

# ### Return Value
The transform of an instance when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
# See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace